<?php

namespace Database\Seeders;

use App\Models\SiteInfoModel;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class SiteInfoSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        SiteInfoModel::insert(
            [
                'site_name' => json_encode(['bn' => 'ভুলতা রেসিডেন্সিয়াল কলেজ', 'en' => 'Bhulta Residential College']),

                'site_short_name' => "BRC",

                'site_logo' => json_encode(['favicon'=> '/assets/img/favicon.jpg', 'logo_square'=> ['16'=> '', '32'=> '','48'=> '','70'=> '', '150'=> '', '96'=> '','256'=> '','310'=> '', '512'=> ''], 'logo_wide'=> ['main_menu'=> '/assets/img/logo/logo.png']]),

                'site_contact'=> json_encode(['hotline'=> '+8801783639135', 'social'=> ['email'=> 'bhultaresidentialcollege@gmail.com','facebook'=>'#','youtube'=> 'https://www.youtube.com/@BhultaResidentialCollege']]),

                'site_administration' => json_encode([
                    "principal" => [
                        "name" => "রেশমা সুলতানা",
                        "designation" => "প্রিন্সিপাল, ভুলতা রেসিডেন্সিয়াল কলেজ",
                        "message" => "আধুনিক প্রযুক্তির সাথে তালমিলিয়ে একটি আর্দশ শিক্ষা প্রতিষ্ঠান গড়ে তোলার মধ্য দিয়ে একটি দেশের সামগ্রিক উন্নতি পথ সুগম হয়। আপনারা জেনে খুশিহবেন ঢাকা সিলেট মহাসড়কের পাশেই (ভুলতা গাউছিয়া) এলাকায় এই প্রথম পূর্ণাঙ্গ ডিজিটালাইসড, আধুনিক শীতাতপ নিয়ন্ত্রিত শুধুমাত্র উচ্চ মাধ্যমিক বিজ্ঞান শিক্ষার্থীদের জন্য ভুলতা রেসিডেন্সিয়াল কলেজ নামে একটি স্মার্ট শিক্ষা প্রতিষ্ঠান প্রতিষ্ঠিত হয়েছে।<br><br><br>ভুলতা রেসিডেন্সিয়াল কলেজ কর্তৃপক্ষ নিশ্চিত করছে যে, একটি সুশৃঙ্খল, আনন্দায়ক ও চমতকার শিক্ষা পরিবেশ সৃষ্টি করা। যা একবিংশ শতকের চ্যালেঞ্জ মোকাবেলা করার জন্য শিক্ষার্থী নিজেকে গড়ে তুলতে সক্ষম হবে। সুশিক্ষাই পারে একজন শিক্ষার্থীকেসত, দক্ষ দেশপ্রেমিক ও মানবিক মূল্যবোধ সম্পন্ন সুনাগরিক হিসেবে গড়ে তুলতে। এইকলেজের শিক্ষার্থীগণ পাবে একাডেমিক পড়াশুনার পাশাপাশি ধর্মীয় নীতি নৈতিকতারশিক্ষা।<br><br><br>সুতরাং, আমি মনে প্রাণে বিশ্বাস করি, আপনার ও আপনার সন্তানের স্বপ্নপূরণে ভুলতারেসিডেন্সিয়াল কলেজ উল্লেখযোগ্য ভূমিকা পালন করবে।"
                    ],
                    "chairman" => [
                        "name" => "সোয়েব ভুঁইয়া",
                        "designation" => "চেয়ারম্যান ও প্রতিষ্ঠাতা পরিচালক",
                        "message" => "ভুলতা রেসিডেন্সিয়াল কলেজের স্ব অর্থায়নে প্রতিষ্ঠিত একটি রাজনৈতিক মুক্তশিক্ষা প্রতিষ্ঠান। এই কলেজের প্রধান লক্ষ্য হচ্ছে বিশ্বায়ন ও একবিংশশতাব্দীর চ্যালেঞ্জ মোকাবেলার জন্য তাত্ত্বিক শিক্ষাকে বাস্তবতার সঙ্গে সমন্বয় করে পাঠদান করা এবং শিক্ষার্থীদেরকে মানবসম্পদে পরিণত করা।<br><br>শিক্ষক ও শিক্ষার্থীর নিবিড় সম্পর্কেই শিক্ষার্থীকে লেখাপড়ার ক্ষেত্রে উতসাহী করে তোলে। যা পরীক্ষারভালোফলাফলের ক্ষেত্রে সহায়ক হয়। বিজ্ঞানমনস্ক প্রযুক্তি নির্ভর আধুনিক জাতি গঠনের জন্য জীবনের প্রতিটিক্ষেত্রেবিজ্ঞানের স্বতঃস্ফূর্ত প্রয়োগ এবং এর ব্যবহারে সক্ষম করে তোলা চেষ্টায় বন্ধ পরিপক ভুলতা রেসিডেন্সিয়ালকলেজের।আমাদের একাদশ শ্রেনির ভর্তি কার্যক্রম, পরীক্ষার ফলাফল, মাসিক বেতন, বিভিন্ন নোটিশ শিক্ষার্থী ওঅভিভাবকের নিকটSMS এর মাধ্যমে প্রেরণসহ কলেজের যাবতীয় তথ্য ওয়েব সাইটের মাধ্যমে পাওয়া যাবে।<br> <br>এই কলেজে রয়েছে শীতাতপ নিয়ন্ত্রিত ক্লাসরুম, ডিজিটাল বোর্ড, বিজ্ঞান চর্চার জন্য আধুনিক ল্যাবরেটরি,প্রযুক্তিগতদক্ষতা অর্জনের জন্য রয়েছে কম্পিউটার ল্যাব, পড়ার জন্য লাইব্রেরীতে রয়েছে সময়োপযোগী পাঠ্যপুস্তক।প্রত্যেকশিক্ষার্থীদের কলেজে ব্যবহৃত সরঞ্জামাদি রাখার জন্য রয়েছে পৃথক লকারের ব্যবস্থা।<br><br>আশাকরি সবার আন্তরিক প্রচেষ্টা ও সহযোগিতায় প্রতিষ্ঠানটি সাফল্যের শীর্ষে উন্নীত হবে। সবার জন্যশুভকামনা"
                    ],
                    "governing_body" => [
                        [
                            "name" => "মোঃ সাইদুল ইসলাম সাদি",
                            "designation" => "সভাপতি ও প্রতিষ্ঠাতা পরিচালক",
                            "message" => "জান ও শক্তির সম্মিলিত শিক্ষার মধ্যেই রয়েছে একটি জাতির উন্নতি। যুগোপযোগীও আধুনিক শিক্ষার মানদণ্ডকে সামনে রেখে ভুলতা রেসিডেন্সিয়াল কলেজপ্রতিষ্ঠিত হয়েছে।<br><br><br>একবিংশ শতাব্দীর জ্ঞান বিজ্ঞানের স্রোত ধারায় সুশিক্ষিত জাতি প্রতিষ্ঠিত করা আমাদের মূল লক্ষ্য। আর সুশিক্ষায় শিক্ষিত মানবজাতিমানবসম্পদে পরিণত হয়। এই অপ্রতিরোধ্য বিজ্ঞানের অগ্রযাত্রায় ভুলতারেসিডেন্সিয়াল কলেজ উল্লেখযোগ্য ভূমিকা পালন করবে। ভুলতা রেসিডেন্সিয়ালকলেজ গতানুগতিক পাঠদানের পাশাপাশি জীবনমুখী শিক্ষা, সহশিক্ষা কার্যক্রমেঅংশগ্রহনের জন্য শিক্ষর্থীদের উতসাহিত করবে। মহান মুক্তিযুদ্ধের আলোকে ভুলতা রেসিডেন্সিয়াল কলেজের শিক্ষর্থীদের বিজ্ঞানচর্চার পাশাপাশি, বিজ্ঞানের বিভিন্ন বিষয় নিয়ে গবেষনা করে বিশ্বের দরবারে কৃতিত্বের স্বাক্ষর রাখবে।"
                        ],
                        [
                            "name" => "",
                            "designation" => "",
                            "message" => ""
                        ]
                    ]
                ]),         
            ]
        );
    }
}
